# RebarSystemTopMajorMatchesTopMinor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemTopMajorMatchesTopMinor Property
ParameterTypeId Class See Also
---
"Top Major and Minor Layers Match"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemTopMajorMatchesTopMinor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemTopMajorMatchesTopMinor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemTopMajorMatchesTopMinor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace